{
    "START":
        "Hello, I am a Bot that sends an image captcha for each new user that joins a group, and kicks anyone that can't solve the captcha within a specified time.\n\nIf a user tries to join the group 5 times in a row and never solves the captcha, I will assume that this \"user\" is a bot, and it will be banned. Also, any message that contains an URL sent by a new \"user\" before the captcha is completed will be considered spam and will be deleted.\n\nRemember to give me administration privileges to kick-ban users and remove messages.\n\nCheck /help command for more information about my usage.\n\nAm I useful? Check /about command and consider making a donation to keep me active.",

    "HELP":
        "Bot help:\n————————————————\n- I am a Bot that sends a captcha for each new user that joins a group, and kick any of them that can't solve the captcha within a specified time.\n\n- If a user tries to join the group 5 times in a row and never solves the captcha, I will assume that the \"user\" is a bot, and it will be banned.\n\n- Any message that contains an URL that has been sent by a new \"user\" before captcha is completed will be considered spam and will be deleted.\n\n- You need to grant me Administration rights so I can kick users and remove messages.\n\n- To preserve a clean group, I auto-remove all messages related to me when a captcha is not solved and the user was kicked (after 5 minutes).\n\n- The time that new users have to solve the captcha is 5 minutes by default, but it can be configured using the command /time.\n\n- You can turn captcha protection on/off using the commands /enable and /disable.\n\n- Configuration commands can only be used by group Administrators.\n\n- You can change the language that I speak, using the command /language.\n\n- You can configure captcha difficulty level using command /difficulty.\n\n- You can set captcha to use full numbers and letters A–Z, or numbers and letters A–F, or just numbers (default), or just a button, using command /captcha_mode.\n\n- You can configure a custom welcome message with command /welcome_msg.\n\n- You can enable an option to let me apply restriction to new joined users to send non-text messages using command /restrict_non_text.\n\n- If the Bot is Private, allow groups with command /allowgroup.\n\n- Check /commands to get a list of all avaliable commands, and a short description of all of them.",

    "CMD_NOT_ALLOW":
        "Only an Admin can use this command.",

    "LANG_CHANGE":
        "Language changed to English.",

    "LANG_SAME":
        "I am already in English.\n\nSupported languages:\n{}",

    "LANG_BAD_LANG":
        "Invalid language provided.\n\nSupported languages:\n{}",

    "LANG_NOT_ARG":
        "The command needs a language to set.\n\nExamples:\n{}",

    "TIME_CHANGE":
        "Time to solve the captcha successfully changed to {} minutes.",

    "TIME_MAX_NOT_ALLOW":
        "The maximum allowed captcha solve time is 20 minutes. The time has not been changed.",

    "TIME_NOT_NUM":
        "The provided time is not an integer number.",

    "TIME_NOT_ARG":
        "The command needs a time value to set (in minutes).\n\nExamples:\n/time 3\n/time 5\n/time 10",

    "DIFFICULTY_CHANGE":
        "Captcha difficulty successfully changed to level {}.",

    "DIFFICULTY_NOT_NUM":
        "The provided captcha difficulty is not a number.",

    "DIFFICULTY_NOT_ARG":
        "The command needs a difficulty level to set (from 1 to 5). Has no effect in \"button\" mode.\n\nExamples:\n/difficulty 1\n/difficulty 2\n/difficulty 3\n/difficulty 4\n/difficulty 5",

    "CAPTCHA_MODE_CHANGE":
        "Captcha mode successfully changed to \"{}\".",

    "CAPTCHA_MODE_INVALID":
        "Invalid captcha mode. Supported modes are: \"nums\", \"hex\", \"ascii\", and \"button\".\n\nExample:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii\n/captcha_mode button",

    "CAPTCHA_MODE_NOT_ARG":
        "The command needs a mode to set. Available modes are:\n- Numeric Captchas (\"nums\").\n- Hexadecimal Captchas, numbers and characters A-F (\"hex\").\n- Numbers and characters A-Z Captchas (\"ascii\").\n- Button-only challenge (\"button\").\n\nExamples:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii\n/captcha_mode button",

    "WELCOME_MSG_SET":
        "Welcome message successfully configured.",

    "WELCOME_MSG_UNSET":
        "Welcome message disabled.",

    "WELCOME_MSG_SET_NOT_ARG":
        "Place the welcome message after the command.\n\nExample:\n/welcome_msg Hi $user, welcome to the group and remember to be respectful with other users.\n\nDisable the message:\n/welcome_msg disable",

    "RESTRICT_NON_TEXT_MSG_ENABLED":
        "Restriction to send non-text messages for new users enabled. I'm gonna remove recently joined user messages that are not text messages.",

    "RESTRICT_NON_TEXT_MSG_DISABLED":
        "Restriction to send non-text messages for new users disabled.",

    "RESTRICT_NON_TEXT_MSG_NOT_ARG":
        "Set if you want to enable or disable recently joined user restrictions to send non-text messages (Don't allow a user to send media or other messages rather than text ones. Admins can manually give that permissions to users again in the future).\n\nExamples:\n/restrict_non_text enable\n/restrict_non_text enable forever\n/restrict_non_text disable",

    "IGNORE_LIST_ADD_NOT_ARG":
        "Please, place the user's ID/alias after the command.\n\nExample:\n/add_ignore 1234567890\n/add_ignore @peter",

    "IGNORE_LIST_ADD_DUPLICATED":
        "This ID/alias is already in ignore list.",

    "IGNORE_LIST_ADD_LIMIT_EXCEEDED":
        "Unfortunately, you have reach the maximum limit of users added in the ignore list, remove someone to add more.",

    "IGNORE_LIST_ADD_INVALID":
        "This ID/alias is invalid.",

    "IGNORE_LIST_ADD_SUCCESS":
        "The ID/alias has been added successfully!",

    "IGNORE_LIST_REMOVE_NOT_ARG":
        "Please, place the user's ID/alias after the command.\n\nExample:\n/remove_ignore 1234567890\n/remove_ignore @peter",

    "IGNORE_LIST_REMOVE_SUCCESS":
        "The ID/alias has been removed successfully!",

    "IGNORE_LIST_REMOVE_NOT_IN_LIST":
        "The ID/alias is not in ignore list, nothing was done.",

    "IGNORE_LIST_EMPTY":
        "Ignore list of the chat is empty.",

    "NEW_USER_CAPTCHA_CAPTION":
        "Hello {}, welcome to {}. Please write a message with the numbers and/or letters that appear in this image to verify that you are a human. If you don't solve the captcha in {} mins, you will be automatically kicked out of the group.",

    "NEW_USER_BUTTON_MODE":
        "Hello {}, welcome to {}. Please press the button below to verify that you are a human. If you don't do this in {} mins, you will be automatically kicked out of the group.",

    "CAPTCHA_SOLVED":
        "Captcha solved, user verified.\nWelcome to the group, {}",

    "CAPTCHA_INCORRECT_0":
        "That is not the correct code. Try again...",

    "CAPTCHA_INCORRECT_1":
        "That is not the correct number. Check closely, the captcha has 4 numbers...",

    "NEW_USER_KICK":
        "{} has not completed the captcha in time. \"User\" was kicked out.",

    "NEW_USER_KICK_NOT_RIGHTS":
        "{} has not completed the captcha in time. I tried to kick out the \"User\", but I don't have administration rights to kick out users from the group.",

    "NEW_USER_KICK_NOT_IN_CHAT":
        "{} has not completed the captcha in time. I tried to kick out the \"User\", but the user is not in the group any more (has left the group or has been kicked out by an Admin).",

    "BOT_CANT_KICK":
        "{} has not completed the captcha in time. I tried to kick out the \"User\", but due to an unexpected problem (maybe network/server related), I can't do it.",

    "CANT_DEL_MSG":
        "I tried to delete this message, but I don't have the administration rights to remove messages that have not been sent by me.",

    "NEW_USER_BAN":
        "Warning: This is the fifth time that {} has tried to join the group and failed to solve the captcha. \"User\" was banned. To let him/her enter again, an Admin has to manually remove the restrictions of this \"user\".",

    "NEW_USER_BAN_NOT_IN_CHAT":
        "Warning: This is the fifth time that {} has tried to join the group and failed to solve the captcha. I tride to ban the \"User\", but the user is not in the group any more (has left the group or has been kicked out/banned by an Admin).",

    "NEW_USER_BAN_NOT_RIGHTS":
        "Warning: This is the fifth time that {} has tried to join the group and failed to solve the captcha. I tried to ban the \"User\", but I don't have administration rights to ban users in the group.",

    "BOT_CANT_BAN":
        "Warning: This is the fifth time that {} has tried to join the group and failed to solve the captcha. I tried to ban the \"User\", but due to an unexpected problem (maybe network/server related), I can't do it.",

    "SPAM_DETECTED_RM":
        "Detected a message with an URL (or alias) from {}, who has not solved the captcha yet. The message has been removed for the sake of keeping Telegram free of Spam :)",

    "SPAM_DETECTED_NOT_RM":
        "Message with an URL (or an alias) detected from {}, who has not solved the captcha yet. I tried to remove the Spam message, but I don't have administration rights to remove messages that have not been sent by me.",

    "NOT_TEXT_MSG_ALLOWED":
        "Removed a non-text message (image, audio, file...) from {}, for the sake of keeping Telegram free of Spam.\n\nYou can send non-text messages after you have solved the captcha.",

    "OTHER_CAPTCHA_BTN_TEXT":
        "Other Captcha",

    "PASS_BTN_TEXT":
        "I'm not a Bot",

    "ENABLE":
        "Captcha protection enabled. Disable it with /disable command.",

    "DISABLE":
        "Captcha protection disabled. Enable it with /enable command.",

    "ALREADY_ENABLE":
        "The captcha protection is already enabled.",

    "ALREADY_DISABLE":
        "The captcha protection is already disabled.",

    "CAN_NOT_GET_ADMINS":
        "Can't use this command in the current chat.",

    "VERSION":
        "Current Bot version: {}",

    "ABOUT_MSG":
        "This Bot is free software and open-sourced under the GNU-GPL license.\nBot Developed by {}.\n\nYou can check the code here:\n{}\n\nDo you like my work? Buy me a coffee.\n\nPaypal:\n{}\n\nBTC:\n{}",

    "COMMANDS":
        "List of commands:\n————————————————\n/start - Shows the initial information about the bot.\n\n/help - Shows the help information.\n\n/commands - Shows this message. Information about all the available commands and their description.\n\n/language - Allows to change the language of the bot's messages.\n\n/time - Allows changing the time available to solve a captcha.\n\n/difficulty - Allows changing captcha difficulty level (from 1 to 5).\n\n/captcha_mode - Allows changing captcha mode (nums: numbers, hex: numbers and A-F chars, ascii: numbers and A-Z chars, button: just a button).\n\n/welcome_msg - Allows to configure a welcome message that is sent after solving the captcha.\n\n/restrict_non_text - After a new user solves the captha, apply a restriction to don't let them send non-text messages (images, videos, audios) for 1 day (or forever, using \"forever\" keyword).\n\n/add_ignore - Do not ask an ignored user the captcha.\n\n/remove_ignore - Stop ignoring an user.\n\n/ignore_list - list of ignored users' IDs.\n\n/allowgroup - Allow a group to use the Bot (if Bot is Private).\n\n/enable - Enable the captcha protection of the group.\n\n/disable - Disable the captcha protection of the group.\n\n/version - Show the version of the Bot.\n\n/about - Show about info."
}
