{
    "START":
        "سلام ، من یک ربات هستم که برای هر کاربر جدید که به گروه می پیوندد ، یک کد تایید بصورت تصویر ارسال می کند ، و به هر کسی که قادر نیست کد کپچا را در یک زمان مشخص حل کند ، لگد می زنم.\n\nاگر کاربر سعی کند 5 بار به گروه بپیوندد یک ردیف و هرگز کد کپچا را حل نمی کنم ، فرض می کنم این\"کاربر\"یک ربات است و ممنوع خواهد بود. همچنین ، هر پیامی که حاوی یک URL باشد که قبل از اتمام کد کپچا توسط یک\"کاربر\"ارسال شده باشد. ، هرزنامه در نظر گرفته خواهد شد و حذف خواهد شد.\n\nیادآوری کنید تا من به من امتیازاتی بدهم که کاربران را منع کرده و کاربران را ممنوع کرده و پیام ها را حذف کنند.\n\nبرای اطلاعات بیشتر در مورد استفاده من ، فرمان /بررسی /راهنما را بررسی کنید.\n\nآیا من مفید هستم؟ /در مورد فرماندهی و در نظر گرفتن کمک مالی برای فعال نگه داشتن من در نظر بگیرید.",

    "HELP":
        "راهنما ربات:\n\n- من یک ربات هستم که برای هر کاربر جدیدی که به گروه می پیوندد ، کپچا ارسال می کند و به کسانی که نمی توانند کد کپچا را در یک زمان مشخص حل کنید.\n\n- اگر کاربر 5 بار پیاپی سعی کند به گروه بپیوندد و هرگز کد کپچا را حل نکند ، فرض می کنم که\"کاربر\"یک ربات است و خواهد بود. ممنوع است.\n\n- هر پیام که حاوی URL باشد که قبل از اتمام کد کپچا توسط یک \"کاربر\" جدید ارسال شده باشد ، هرزنامه تلقی خواهد شد و حذف خواهد شد.\n\n- شما باید به من مدیریت کنید حقوق برای کاربران لگد زدن و حذف پیام ها.\n\n- برای حفظ یک گروه تمیز ، وقتی پیام کد کپچا حل نشد و کاربر لگد خورد شد ، پیام های مربوط به من را به طور خودکار حذف می کنم.\n\n- زمان استفاده کاربران جدید برای حل کد کپچا 5 دقیقه به طور پیش فرض است ، اما می توان آن را با استفاده از دستور /time پیکربندی کرد .=n\n- شما می توانید با استفاده از دستورات /محافظت از کد کپچا را با استفاده از دستورات /فعال یا غیرفعال کنید. n\n- دستورات پیکربندی فقط توسط gr قابل استفاده هستند شما می توانید با استفاده از دستور /زبان. زبانی را که من صحبت می کنم تغییر دهید. می توانید سطح دشواری کد کپچا را با استفاده از دستور /difficulty. پیکربندی کنید. فقط اعداد (پیش فرض) یا تعداد کامل و نامه ها را با استفاده از دستور /captcha_mode.\n\n- می توانید پیغام خوش آمد گویی سفارشی را با دستور پیکربندی کنید /welcome_msg.\n\n- You can enable an option to let me apply restriction to new joined users to send non-text messages using command /restrict_non_text.\n\n- If the Bot is Private, allow groups with command /allowgroup.\n\n- چک /دستورات را برای دریافت لیستی از تمام دستورات قابل دسترسی تنظیم کنید و شرح مختصری از همه آنها.",

    "CMD_NOT_ALLOW":
        "فقط یک سرپرست می تواند از این دستور استفاده کند.",

    "LANG_CHANGE":
        "زبان به انگلیسی تغییر یافت.",

    "LANG_SAME":
        "من قبلاً به زبان انگلیسی هستم.\n\nزبانهای پشتیبانی شده:\n{}",

    "LANG_BAD_LANG":
        "زبان نامعتبر ارائه شده است.\n\nزبانهای پشتیبانی شده:\n{}",

    "LANG_NOT_ARG":
        "این دستور برای تنظیم یک زبان نیاز دارد.\n\nمثال:\n{}",

    "TIME_CHANGE":
        "زمان برای حل کد کپچا با موفقیت به {} دقیقه تغییر یافت.",

    "TIME_MAX_NOT_ALLOW":
        "حداکثر زمان مجاز برای حل کپچا 20 دقیقه است. زمان تغییر نکرده است.",

    "TIME_NOT_NUM":
        "زمان ارائه شده عدد صحیحی نیست.",

    "TIME_NOT_ARG":
        "این دستور برای تنظیم یک مقدار زمان (در عرض چند دقیقه) نیاز دارد.\n\nمثال:\n/time 3\n/time 5\n/time 10",

    "DIFFICULTY_CHANGE":
        "مشکل کپپا با موفقیت به سطح {} تغییر یافت.",

    "DIFFICULTY_NOT_NUM":
        "مشکل کپچا ارائه شده یک عدد نیست.",

    "DIFFICULTY_NOT_ARG":
        "این فرمان برای تنظیم سطح دشواری نیاز دارد (از 1 تا 5).\n\nمثال:\n/دشوار 1\n/مشکل 2\n/مشکل 3\n/مشکل 4\n/مشکل 5",

    "CAPTCHA_MODE_CHANGE":
        "حالت کاراکتر کد کپچا با موفقیت به\"{}\"تغییر یافت.",

    "CAPTCHA_MODE_INVALID":
        "حالت کاراکتر کد کپچا نامعتبر است. حالتهای پشتیبانی شده عبارتند از:\"nums\"،\"hex\"و\"ascii\".\n\nمثال:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii\n/captcha_mode button",

    "CAPTCHA_MODE_NOT_ARG":
        "این دستور برای تنظیم یک حالت کاراکتر نیاز دارد. حالتهای موجود عبارتند از:\n- ضبط های عددی (\"nums\").\n- ضبط های شش ضلعی ، اعداد و شخصیت های AF (\"hex\").\n- اعداد و شخصیت های AZ Captchas (\"ascii\").\n\nمثال:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii\n/captcha_mode button",

    "WELCOME_MSG_SET":
        "پیام خوش آمدید با موفقیت پیکربندی شده است.",

    "WELCOME_MSG_UNSET":
        "پیام خوش آمدید غیرفعال است.",

    "WELCOME_MSG_SET_NOT_ARG":
        "پیام خوش آمدید را بعد از دستور قرار دهید.\n\nمثال:\n/Welcome_msg سلام کاربر کاربر ، به این گروه خوش آمدید و به یاد داشته باشید که با سایر کاربران احترام بگذارید.\n\nپیام را غیرفعال کنید:\n/Welcome_msg غیرفعال شود",

    "RESTRICT_NON_TEXT_MSG_ENABLED":
        "Restriction to send non-text messages for new users enabled. I'm gonna remove new joined users permissions except text messages send.\n\n[This text needs translate to actual configured language]",

    "RESTRICT_NON_TEXT_MSG_DISABLED":
        "Restriction to send non-text messages for new users disabled.\n\n[This text needs translate to actual configured language]",

    "RESTRICT_NON_TEXT_MSG_NOT_ARG":
        "Set if you want to enable or disable new join users restriction to send non-text messages (Don't allow user send media or others messages rather than text ones. Admins can manually give that permissions to users again in the future).\n\nExample:\n/restrict_non_text enable\n/restrict_non_text disable\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_NOT_ARG":
        "Please, place the user's ID/alias after the command.\n\nExample:\n/add_ignore 1234567890\n/add_ignore @peter\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_DUPLICATED":
        "This ID/alias is already in ignore list.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_LIMIT_EXCEEDED":
        "Unfortunately, you have reach the maximum limit of users added in the ignore list, remove someone to add more.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_INVALID":
        "This ID/alias is invalid.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_SUCCESS":
        "The ID/alias has been added successfully!\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_REMOVE_NOT_ARG":
        "Please, place the user's ID/alias after the command.\n\nExample:\n/remove_ignore 1234567890\n/remove_ignore @peter\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_REMOVE_SUCCESS":
        "The ID/alias has been removed successfully!\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_REMOVE_NOT_IN_LIST":
        "This ID is not in ignore list, nothing was done.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_EMPTY":
        "Ignore list of the chat is empty.\n\n[This text needs translate to actual configured language]",

    "NEW_USER_CAPTCHA_CAPTION":
        "Hello {}, welcome to {}, لطفاً پیامی را با شماره موجود در این کد کپچا ارسال کنید تا تأیید کنید که یک انسان هستید. اگر کد کپچا را در {} دقیقه حل نکنید ، به طور خودکار از گروه اخراج خواهید شد. اگر حروف وجود داشته باشد ، حروف بزرگ و کوچک تفاوت می کنند.",

    "NEW_USER_BUTTON_MODE":
        "Hello {}, welcome to {}. Please press the button below to verify that you are a human. If you don't do this in {} mins, you will be automatically kicked out of the group.\n\n[This text needs translate to actual configured language]",

    "CAPTCHA_SOLVED":
        "کد کپچا حل شد ، کاربر تأیید شد.\nبه گروه خوش آمدید",

    "CAPTCHA_INCORRECT_0":
        "این تعداد درستی نیست. سعی کنید دوباره ...",

    "CAPTCHA_INCORRECT_1":
        "این عدد صحیح نیست. از نزدیک بررسی کنید ، کد کپچا 4 عدد دارد ...",

    "NEW_USER_KICK":
        "{the کد کپچا را به موقع تکمیل نکرد.\"کاربر\"لگد شد.",

    "NEW_USER_KICK_NOT_RIGHTS":
        "{the به موقع کد کپچا را کامل نکرده است. من سعی کردم\"کاربر\"را بزنم ، اما من حق مدیریتی برای زدن کاربران در گروه ندارم.",

    "NEW_USER_KICK_NOT_IN_CHAT":
        "{the کد کپچا را به موقع تکمیل نکرده است. من سعی کردم\"کاربر\"را لگد بزنم ، اما کاربر در گروه نیست (گروه را ترک کرده یا توسط یک مدیر لگد شده است.)",

    "BOT_CANT_KICK":
        "{the کد کپچا را به موقع تکمیل نکرده است. من سعی کردم\"کاربر\"را لگد بزنم ، اما به دلیل یک مشکل غیر منتظره (ممکن است مربوط به شبکه /سرور) ، نمی توانم آن را انجام دهم.",

    "CANT_DEL_MSG":
        "من سعی کردم این پیام را حذف کنم ، اما من حق دولت برای حذف پیام هایی که توسط من ارسال نشده است را ندارم.",

    "NEW_USER_BAN":
        "هشدار: این پنجمین باری است که {} سعی در پیوستن به گروه را دارد و نتوانسته است کد کپچا را حل کند.\"کاربر\"ممنوع است. برای اجازه دادن دوباره وارد شدن وی ، یک مدیر مجبور است به صورت دستی محدودیت های این را حذف کند\"کاربر\".",

    "NEW_USER_BAN_NOT_IN_CHAT":
        "هشدار: این پنجمین باری است که {} سعی در پیوستن به گروه را دارد و نتوانسته کد کپچا را حل کند. من سعی می کنم\"User\"را ممنوع کنم ، اما کاربر در گروه نیست (گروه را ترک کرده است یا توسط سرپرست لگد /ممنوع شده است.)",

    "NEW_USER_BAN_NOT_RIGHTS":
        "هشدار: این پنجمین باری است که {} سعی در پیوستن به گروه را دارد و نتوانسته است کد کپچا را حل کند. من سعی کردم\"کاربر\"را ممنوع کنم ، اما من حق مدیریتی برای ممنوع کردن کاربران در گروه ندارم.",

    "BOT_CANT_BAN":
        "هشدار: این پنجمین باری است که {} سعی در پیوستن به گروه را دارد و نتوانسته کد کپچا را حل کند. من سعی کردم\"User\"را ممنوع کنم ، اما به دلیل یک مشکل غیرمنتظره (شاید مربوط به شبکه /سرور) باشد. نمی توانید آن را انجام دهید.",

    "SPAM_DETECTED_RM":
        "پیامی با URL (یا نام مستعار) از} ected کشف شد ، که هنوز کد کپچا را حل نکرده است. این پیام به دلیل نگه داشتن تلگرام از هرزنامه حذف شده است:)",

    "SPAM_DETECTED_NOT_RM":
        "پیغام با URL (یا نام مستعار) شناسایی شده از} who ، که هنوز کد کپچا را حل نکرده است. من سعی کردم پیام Spam را حذف کنم ، اما من حق مدیریت برای حذف پیام هایی که توسط من ارسال نشده است ندارم.",

    "NOT_TEXT_MSG_ALLOWED":
        "به دلیل نگه داشتن تلگرام از هرزنامه ، پیام غیر متنی (تصویر ، صدا ، پرونده ...) را از {oved حذف کردید.\n\nشما می توانید پیام های غیر متنی را پس از حل کردن کد کپچا ارسال کنید.",

    "OTHER_CAPTCHA_BTN_TEXT":
        "دیگر کپچا",

    "PASS_BTN_TEXT":
        "I'm not a Bot",

    "BOT_LEAVE_CHANNEL":
        "This Bot can't be used in channels, just in groups..\n\n[This text needs translate to actual configured language]",

    "ENABLE":
        "محافظت از کد کپچا فعال است. آن را با دستور /غیرفعال کردن غیرفعال کنید.",

    "DISABLE":
        "محافظت از کد کپچا غیرفعال است. آن را با فرمان /فعال کردن فعال کنید.",

    "ALREADY_ENABLE":
        "محافظت از کد کپچا قبلاً فعال شده است.",

    "ALREADY_DISABLE":
        "محافظت از کد کپچا در حال حاضر غیرفعال است.",

    "CAN_NOT_GET_ADMINS":
        "نمی توان از این دستور در گپ فعلی استفاده کرد.",

    "VERSION":
        "نسخه فعلی Bot: {}",

    "ABOUT_MSG":
        "این Bot نرم افزار رایگان است و با مجوز GNU-GPL منبع باز است.\nایجاد شده توسط {}.\n\nشما می توانید کد را در اینجا بررسی کنید:\n}\n\nآیا کارهای من را دوست دارید؟ من بخرید قهوه.\n\nپی پال:\n{}\n\nBTC:\n{}",

    "COMMANDS":
        "لیست دستورات:\n————————————————\n/شروع - اطلاعات اولیه درباره ربات را نشان می دهد.\n\n/help - اطلاعات راهنما را نشان می دهد.\n\n/دستورات - این پیام را نشان می دهد. اطلاعات مربوط به کلیه دستورات موجود و توضیحات آنها.\n\n/Language - اجازه می دهد تا زبان پیامهای ربات را تغییر دهید زبانهای موجود در حال حاضر.\n\n/time - اجازه می دهد تا زمان در دسترس برای حل یک کد کپچا را تغییر دهید.\n\n/دشواری - تغییر سطح دشواری کد کپچا (از 1 به 5) را مجاز می کند.\n\n/captcha_mode - اجازه می دهد تا تغییر حالت شخصیت کد کپچا (شماره ها: فقط اعداد ، سحر و جادو: اعداد و کاراکترهای AF ، ascii: اعداد و کاراکترهای AZ).\n\n/Welcome_msg - پیغام خوشآمدگویی را که پس از حل کردن کد کپچا ارسال شده است پیکربندی می کند.\n\n/را فعال کنید - محافظت از کد کپچا گروه را فعال کنید.\n\n/غیرفعال کنید - محافظت از کد کپچا گروه را غیرفعال کنید.\n\n/نسخه - نسخه Bot را نشان دهید.\n\n/about - نمایش درباره اطلاعات."
}
