{
    "START" :
        "Ola, son un Bot que envía unha imaxe captcha a cada novo usuario que se una ao grupo, e expulso (kick) aos que non resolvan o captcha nun tempo determinado.\n\nSe un usuario intentouse unir ao grupo 5 veces e nunca conseguiu resolver o captcha, suporei que ese \"usuario\" é un Bot e, tras expulsalo, bloqueareino (ban) para que non poida volver a entrar no grupo. Además, calquera mensaxe que conteña unha URL e fora enviada por un novo \"usuario\" antes de que este resolvera o captcha, será considerada unha mensaxe de Spam e será borrada.\n\nLembra que para funcionar de maneira adecuada debes darme permisos de administración para suspender usuarios e eliminar mensaxes do grupo.\n\nBota un vistazo ao comando /help para coñecer máis información sobre o meu uso.\n\nSon útil? Bota un vistazo ao comando /about e considera facer unha donación para manterme activo.",

    "HELP" :
        "Axuda sobre o Bot:\n————————————————\n- Son un Bot que envía un captcha a cada novo usuario que se une ao grupo, e expulso (kick) aos que no resolvan o captcha nun tempo determinado.\n\n- Se un usuario intentou unirse ao grupo 5 veces e nunca conseguiu resolver o captcha, suporei que ese \"usuario\" é un Bot e, tras expulsalo, bloqueareino(ban) para que non poida volver a entrar no grupo.\n\n- Calquera mensaxe que conteña unha URL e fora enviada por un novo \"usuario\" antes de que este resolvera o captcha, será considerada unha mensaxe de Spam e será borrada.\n\n- Debes darme permisos de Administración para suspender usuarios e eliminar mensaxes.\n\n- Para manter limpio o grupo, elimino aquelas mensaxes que teñan relación conmigo cando no se resolvera o captcha e o usuario sexa expulsado (transcurridos 5 minutos).\n\n- O tempo que dispoñen os usuarios para resolver o captcha son 5 minutos, pero este tempo pode ser cambiado mediante o comando /time.\n\n- Podes activar ou desactivar a protección captcha mediante os comandos /enable e /disable.\n\n- Os comandos de configuracións só poden ser usados polos Administradores do grupo.\n\n- Podes cambiar o idioma no que falo mediante o comando /language.\n\n- Podes configurar o nivel de dificultade do captcha mediante o comando /difficulty.\n\n- Podes establecer que os captchas só conteñan números (por defecto), ou números e letras, a través do comando /captcha_mode.\n\n- Bota un vistazo ao comando /commands para ver unha lista con todos os comandos dispoñibles e unha breve descripción de cada un deles.",

    "CMD_NOT_ALLOW" :
        "Só un Admin pode utilizar este comando.",

    "LANG_CHANGE" :
        "Idioma cambiado a galego.",

    "LANG_SAME" :
        "Xa estou en galego.\n\nIdiomas compatibles:\n{}",

    "LANG_BAD_LANG" :
        "Idioma inválidado.\n\nIdiomas compatibles:\n{}",

    "LANG_NOT_ARG" :
        "O comando necesita un idioma que establecer.\n\nExemplos:\n{}",

    "TIME_CHANGE" :
        "Tempo para resolver o captcha cambiado a {} minutos.",

    "TIME_MAX_NOT_ALLOW" :
        "O tempo máximo para resolver o captcha son 120 minutos. Non se cambiou o tempo.",

    "TIME_NOT_NUM" :
        "O tempo entregado non é un número enteiro.",

    "TIME_NOT_ARG" :
        "O comando necesita un valor de tempo a establecer (en minutos).\n\nExemplos:\n/time 3\n/time 5\n/time 10",

    "DIFFICULTY_CHANGE" :
        "Nivel de dificultade de los captchas cambiado a {}.",

    "DIFFICULTY_NOT_NUM" :
        "O nivel de dificultade proporcionado non é un número.",

    "DIFFICULTY_NOT_ARG" :
        "O comando necesita un nivel de dificultade a establecer (do 1 ao 5).\n\nExemplos:\n/difficulty 1\n/difficulty 2\n/difficulty 3\n/difficulty 4\n/difficulty 5",

    "CAPTCHA_MODE_CHANGE" :
        "Modo-caracter dos capcthas cambiado a \"{}\".",

    "CAPTCHA_MODE_INVALID" :
        "Modo-caracter invalido. Os modos dispoñibles son: \"nums\", \"hex\" e \"ascii\".\n\nExemplos:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii",

    "CAPTCHA_MODE_NOT_ARG" :
        "O comando necesita o modo-caracter a establecer. Os modos dispoñibles son:\n- Captchas numéricos (\"nums\").\n- Captchas hexadecimais, con números e letras A-F (\"hex\").\n- Captchas con números e letras A-Z (\"ascii\").\n\nExemplos:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii",

    "NEW_USER_CAPTCHA_CAPTION" :
        "Ola {}, benvido a {}, por favor envía unha mensaxe co número que aparece nesta imaxe para verificar que eres un humano. Se non resolves ese captcha en {} mins, serás expulsado (kick) do grupo automáticamente.",

    "CAPTHA_SOLVED" :
        "Captcha resolto, usuario verificado.\nBenvido ao grupo {}",

    "CAPTCHA_INCORRECT_0" :
        "Ese non é o número correcto. Inténtao novamente...",

    "CAPTCHA_INCORRECT_1" :
        "Ese non é o número correcto. Fíxate ben, o captcha ten 4 números...",

    "NEW_USER_KICK" :
        "{} non completou o captcha a tempo. O \"usuario\" foi expulsado (kick).",

    "NEW_USER_KICK_NOT_RIGHTS" :
        "{} non completou o captcha a tempo. O \"usuario\" debería ser expulsado (kick), pero non se me deron os privilexios de administración necesarios para expulsar usuarios do grupo.",

    "NEW_USER_KICK_NOT_IN_CHAT" :
        "{} non completou o captcha a tempo. Iba expulsar (kick) ao \"usuario\", pero xa non se encontra no grupo (Saliu do grupo o foi expulsado por un Admin).",

    "BOT_CANT_KICK" :
        "{} non completou o captcha a tempo. Intentei expulsar (kcik) ao \"usuario\", pero debido a un problema inesperado (quizais relacionado ca rede ou o servidor), non puiden facelo.",

    "CANT_DEL_MSG" :
        "Intentei borrar esta mensaxe pero non se me deron os privilexios de administración necesarios para eliminar mensaxes que non son meus.",

    "NEW_USER_BAN" :
        "Atención: Esta é a quinta vez que o usuario {} intentou unirse ao grupo e non puido resolver o captcha. O \"usuario\" foi expulsado e bloqueado (ban). Para permitir que intente entrar novamente ao grupo, un Admin debe de quitar a restricción do usuario de forma manual nas opciones de administración do grupo.",

    "NEW_USER_BAN_NOT_IN_CHAT" :
        "Atención: Esta é a quinta vez que o usuario {} intentou unirse ao grupo e non puido resolver o captcha. O \"usuario\" debería ser expulsado e bloqueado (ban), pero xa non se encontra no grupo (saíu do grupo ou foi expulsado por un Admin).",

    "NEW_USER_BAN_NOT_RIGHTS" :
        "Atención: Esta é a quinta vez que o usuario {} intentou unirse ao grupo e non puido resolver o captcha. O \"usuario\" debería ser expulsado e bloqueado (ban), pero non se me deron os privilexios de administración necesarios para expulsar usuarios do grupo.",

    "BOT_CANT_BAN" :
        "Atención: Esta é a quinta vez que o usuario {} intentou unirse ao grupo e non puido resolver o captcha. O \"usuario\" debería ser expulsado e bloqueado (ban), pero debido a un problema inesperado (quizais relacionado ca rede ou o servidor), non puiden facelo.",

    "SPAM_DETECTED_RM" :
        "Detectouse unha mensaxe que contén unha URL (ou alias) enviado por {}, quen aínda non resolveu o captcha. A mensaxe foi eliminada en aras dun Telegram libre de Spam :)",

    "SPAM_DETECTED_NOT_RM" :
        "Detectouse unha mensaxe que contén unha URL (ou alias) enviado por {}, quen aínda non resolveu o captcha. Intentei borrar a mensaxe, pero non se me deron os privilexios de administración necesarios para eliminar mensaxes que non son meus.",

    "NOT_TEXT_MSG_ALLOWED" :
        "Eliminada unha mensaje que non é de texto (imaxe, audio, arquivo...) enviado por {}, en aras dun Telegram libre de Spam.\n\nPoderás enviar mensaxes que non sexan de texto unha vez que haxas resolto o captcha.",

    "OTHER_CAPTCHA_BTN_TEXT" :
        "Otro Captcha",

    "ENABLE" :
        "Protección captcha activada. Desactívaa co comando /disable.",

    "DISABLE" :
        "Protección captcha desactivada. Actívaa co comando /enable.",

    "ALREADY_ENABLE" :
        "A protección captcha xa está activada.",

    "ALREADY_DISABLE" :
        "A protección captcha xa está desactivada.",

    "CAN_NOT_GET_ADMINS" :
        "Non se pode usar este comando no chat actual.",

    "VERSION" :
        "Versión actual do Bot: {}",

    "ABOUT_MSG" :
        "Iste é un Bot de software libre open-source con licencia GNU-GPL, desenrolado por {}.\n\nPodes consultar o código aquí:\n{}\n\nGústache o que fago? Invítame a un café.\n\nPaypal:\n{}\n\nBTC:\n{}",

    "COMMANDS" :
        "Lista de comandos:\n————————————————\n/start - Mostra a información inicial sobre o Bot.\n\n/help - Mostra a información de axuda.\n\n/commands - Mostra a mensaxe actual. Información sobre todos os comandos dispoñibles e a súa descripción.\n\n/language - Permite cambiar o idioma no que fala o Bot. Idiomas actualmente dispoñibles: {}.\n\n/time - Permite cambiar o tempo dispoñible para resolver un captcha.\n\n/difficulty - Permite cambiar o nivel de dificultade do captcha (do 1 ao 5).\n\n/captcha_mode - Permite cambiar o modo-caracter dos captchas (nums: só números, hex: números e letras A-F, ascii: números e letras A-Z).\n\n/enable - Activa a protección captcha no grupo.\n\n/disable - Desactiva a protección captcha no grupo.\n\n/version - Consulta a versión do Bot.\n\n/about - Mostra a información \"acerca do...\" do Bot."
}