{
    "START":
        "Halo, Saya adalah Bot yang akan mengirimkan verifikasi captcha untuk setiap pengguna yang bergabung ke grup, dan akan mengeluarkannya bila tidak menyelesaikan captcha dalam waktu yang ditentukan. \n\nIf Pengguna yang mencoba bergabung dengan grup sebanyak 5 kali dan tidak menyelesaikan captcha, saya akan mengasumsikan  \"user\" adalah bot, dan akan dibanned. Juga, setiap pesan yang terdapat URL dikirim oleh \"user\"  sebelum menyelesaikan verifikasi captcha, akan dianggap spam dan akan dihapus.\n\nIngatlah untuk memberikan saya hak istimewa administrator untuk mengkick-banned pengguna dan menghapus pesannya.\n\nCek perintah /help untuk informasi lebih lanjut tentang cara penggunaanku.\n\nAku Berguna? Cek perintah /about dan silahkan berdonasi untukku dan menjaga bot tetap aktif.",

    "HELP":
        "Bantuan Bot:\n————————————————\n- Aku adalah bot yang akan mengirimkan verifikasi captcha untuk setiap pengguna yang bergabung ke grup, dan akan mengeluarkannya bila tidak menyelesaikan captcha dalam waktu yang ditentukan.\n\n- If Pengguna yang mencoba bergabung dengan grup sebanyak 5 kali dan tidak menyelesaikan captcha, saya akan mengasumsikan  \"user\" adalah bot, dan akan dibanned.\n\n- setiap pesan yang terdapat URL dikirim oleh \"user\"  sebelum menyelesaikan verifikasi captcha, akan dianggap spam dan akan dihapus.\n\n- berikan saya hak istimewa administrator untuk mengkick-banned pengguna dan menghapus pesannya.\n\n- Untuk meciptakan grup yang bersih, saya akan otomatis menghapus semua pesan yang dikirimkan kepadaku ketika pengguna tidak menyelesaikan captcha dan pengguna telah dikeluarkan (setelah 5 menit).\n\n- Tenggat waktu yang diberikan kepada pengguna baru untuk menyelesaikan captcha adalah 5 menit, dan bisa dikonfigurasikan ulang menggunakan perintah /time.\n\n- Kamu bisa mematikan/menyalakan perlindungan captcha dengan menggunakan perintah /enable dan /disable.\n\n- Perintah konfigurasi hanya bisa digunakan oleh Administrator grup.\n\n- Kamu bisa mengganti bahasa yang aku gunakan, dengan menggunakan perintah /language.\n\n- Kamu bisa mengatur tingkat kesulitan captcha dengan menggunakan perintah /difficulty.\n\n- Kamu bisa mengatur captcha agar hanya menggunakan angka (bawaannya) atau kombinasi angka dan huruf, dengan menggunakan perintah /captcha_mode.\n\n- Kamu bisa mengatur pesan selamat datang khusus dengan perintah /welcome_msg.\n\n- Cek /commands untuk mendapatkan daftar semua perintah yang tersedia, dan penjelasan singkatnya.",

    "CMD_NOT_ALLOW":
        "Hanya admin yang dapat menggunakan perintah ini!.",

    "LANG_CHANGE":
        "Bahasa diubah ke Bahasa Indonesia.",

    "LANG_SAME":
        "Aku sudah berbahasa Indonesia!.\n\nSupported languages:\n{}",

    "LANG_BAD_LANG":
        "Bahasa tidak tersedia.\n\nSupported languages:\n{}",

    "LANG_NOT_ARG":
        "Perintah ini memerlukan penyetingan bahasa.\n\nExamples:\n{}",

    "TIME_CHANGE":
        "Tenggat waktu penyelesaian captcha berhasil diubah ke {} menit.",

    "TIME_MAX_NOT_ALLOW":
        "Maksimal tenggat waktu yang diperbolehkan untuk menyelesaikan captcha adalah 120 menit. Tenggat waktu tetap belum diubah.",

    "TIME_NOT_NUM":
        "Tenggat waktu yang kamu ketik bukanlah angka.",

    "TIME_NOT_ARG":
        "Perintah memerlukan jumlah waktu untuk diatur (dalam menit).\n\nContoh:\n/time 3\n/time 5\n/time 10",

    "DIFFICULTY_CHANGE":
        "Tingkat kesulitan captcha berhasil diubah ke level {}.",

    "DIFFICULTY_NOT_NUM":
        "Tingkat kesulitan captcha yang didukung bukanlah angka.",

    "DIFFICULTY_NOT_ARG":
        "Perintah memerlukan tingkat kesulitan untuk diatur (dari 1 ke 5).\n\nContoh:\n/difficulty 1\n/difficulty 2\n/difficulty 3\n/difficulty 4\n/difficulty 5",

    "CAPTCHA_MODE_CHANGE":
        "Mode karakter captcha berhasil diubah ke \"{}\".",

    "CAPTCHA_MODE_INVALID":
        "Mode karakter captcha tidak valid. mode yang didukung: \"nums\", \"hex\" and \"ascii\".\n\nContoh:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii",

    "CAPTCHA_MODE_NOT_ARG":
        "Perintah memerlukan mode karakter untuk diatur. Mode yang tersedia:\n- Captcha Angka (\"nums\").\n- Captcha HexaDesimal, angka dan huruf A-F (\"hex\").\n- Angka dan Captcha huruf A-Z (\"ascii\").\n\nContoh:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii",

    "WELCOME_MSG_SET":
        "Pesan selamat datang berhasil diatur.",

    "WELCOME_MSG_UNSET":
        "Pesan selamat datang dinonaktifkan.",

    "WELCOME_MSG_SET_NOT_ARG":
        "Taruh pesan selamat datangnya setelah perintah.\n\nContoh:\n/welcome_msg Hai $user, selamat datang di grup dan ingatlah untuk menghormati pengguna lain.\n\nMenonatifkan pesan selamat datang:\n/welcome_msg disable",

    "RESTRICT_NON_TEXT_MSG_ENABLED":
        "Restriction to send non-text messages for new users enabled. I'm gonna remove new joined users permissions except text messages send.\n\n[This text needs translate to actual configured language]",

    "RESTRICT_NON_TEXT_MSG_DISABLED":
        "Restriction to send non-text messages for new users disabled.\n\n[This text needs translate to actual configured language]",

    "RESTRICT_NON_TEXT_MSG_NOT_ARG":
        "Set if you want to enable or disable new join users restriction to send non-text messages (Don't allow user send media or others messages rather than text ones. Admins can manually give that permissions to users again in the future).\n\nExample:\n/restrict_non_text enable\n/restrict_non_text disable\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_NOT_ARG":
        "Please, place the user's ID/alias after the command.\n\nExample:\n/add_ignore 1234567890\n/add_ignore @peter\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_DUPLICATED":
        "This ID/alias is already in ignore list.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_LIMIT_EXCEEDED":
        "Unfortunately, you have reach the maximum limit of users added in the ignore list, remove someone to add more.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_INVALID":
        "This ID/alias is invalid.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_ADD_SUCCESS":
        "The ID/alias has been added successfully!\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_REMOVE_NOT_ARG":
        "Please, place the user's ID/alias after the command.\n\nExample:\n/remove_ignore 1234567890\n/remove_ignore @peter\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_REMOVE_SUCCESS":
        "The ID/alias has been removed successfully!\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_REMOVE_NOT_IN_LIST":
        "This ID/alias is not in ignore list, nothing was done.\n\n[This text needs translate to actual configured language]",

    "IGNORE_LIST_EMPTY":
        "Ignore list of the chat is empty.\n\n[This text needs translate to actual configured language]",

    "NEW_USER_CAPTCHA_CAPTION":
        "Halo {}, selamat datang di {}, tolong kirimkan pesan dengan angka yang terdapat dalam captcha untuk memastikan kamu benar- benar orang. Jika kamu tidak menyelesaikan verifikasi captcha dalam {} menit, kamu akan otomatis dikeluarkan dari grup. Bila dalam verifikasi terdapat huruf, besar dan kecilnya huruf wajib diperhatikan.",

    "CAPTCHA_SOLVED":
        "Captcha selesai, Pengguna telah diverifikasi.\nSelamat datang di grup {}",

    "CAPTCHA_INCORRECT_0":
        "Nomor yang kamu masukan salah. Coba kembali...",

    "CAPTCHA_INCORRECT_1":
        "Itu bukan nomor yang benar. Cek lebih teliti, captcha memiliki 4 angka...",

    "NEW_USER_KICK":
        "{} tidak menyelesaikan captcha dalam waktu yang ditentukan. \"User\" Telah dikeluarkan.",

    "NEW_USER_KICK_NOT_RIGHTS":
        "{} tidak menyelesaikan captcha. Saya mencoba mengeluarkan \"User\", tetapi aku tidak memiliki hak istimewa administrator untuk mengeluarkan pengguna dari grup.",

    "NEW_USER_KICK_NOT_IN_CHAT":
        "{} tidak menyelesaikan captcha. Saya mencoba mengeluarkan \"User\", tapi pengguna ini tidak berada dalam grup (telah meninggalkan grup atau telah dikeluarkan oleh admin).",

    "BOT_CANT_KICK":
        "{} tidak menyelesaikan captcha. Saya mencoba mengeluarkan \"User\", tapi gagal diakibatkan oleh masalah yang tidak diketahui (mungkin server down atau mengalami gangguan).",

    "CANT_DEL_MSG":
        "Saya mencoba menghapus pesan ini, tetapi saya tidak memiliki hak istimewa administrator untuk menghapus pesan yang belum dikirimkan oleh saya.",

    "NEW_USER_BAN":
        "Peringatan: Ini adalah kelima kalinya {} mencoba bergabung ke grup dan gagal menyelesaikan captcha. \"User\" telah diblokir. Untuk membiarkan pengguna ini bergabung kembali, Admin harus secara manual menghapus pemblokiran \"user\" ini.",

    "NEW_USER_BAN_NOT_IN_CHAT":
        "Peringatan: Ini adalah kelima kalinya {} mencoba bergabung ke grup dan gagal menyelesaikan captcha. Saya mencoba memblokir \"User\", tetapi pengguna ini tidak berada dalam grup (telah meninggalkan grup atu dikeluarkan/diblokir oleh admin).",

    "NEW_USER_BAN_NOT_RIGHTS":
        "Peringatan: Ini adalah kelima kalinya {} mencoba bergabung ke grup dan gagal menyelesaikan captcha. Saya mencoba memblokir \"User\", tetapi saya tidak memiliki hak istimewa administrator untuk memblokir pengguna ini.",

    "BOT_CANT_BAN":
        "Peringatan: Ini adalah kelima kalinya {} mencoba bergabung ke grup dan gagal menyelesaikan captcha. Saya mencoba memblokir \"User\", tetapi gagal diakibatkan oleh masalah yang tidak diketahui (mungkin server down atau mengalami gangguan).",

    "SPAM_DETECTED_RM":
        "Mendeteksi pesan dengan URL (atau alias) dari {}, yang belum menyelesaikan captcha. Pesan telah dihapus untuk menjaga telegram tetap bebas dari spam:)",

    "SPAM_DETECTED_NOT_RM":
        "Pesan dengan URL (atau alias) terdeteksi dari {}, yang belum menyelesaikan captcha. Saya mencoba untuk menghapus pesan spam, tapi saya tidak memiliki hak istimewa administrator untuk menghapus pesan yang belum dikirimkan oleh saya.",

    "NOT_TEXT_MSG_ALLOWED":
        "Menghapus pesan media (gambar, audio, file...) dari {}, untuk menjaga telegram tetap bebas dari spam.\n\nKamu bjsa mengirimkan pesan media setelah kamu menyelesaikan captcha.",

    "OTHER_CAPTCHA_BTN_TEXT":
        "Captcha lainnya",

    "BOT_LEAVE_CHANNEL":
        "This Bot can't be used in channels, just in groups.\n\n[This text needs translate to actual configured language]",

    "ENABLE":
        "Proteksi Captcha diaktifkan. Nonaktifkan captcha dengan perintah /disable ",

    "DISABLE":
        "Proteksi Captcha dinonaktifkan. Aktifkan captcha dengan perintah /enable ",

    "ALREADY_ENABLE":
        "Proteksi captcha sudah diaktifkan sebelumnya.",

    "ALREADY_DISABLE":
        "Proteksi captcha sudah dinonaktifkan sebelumnya",

    "CAN_NOT_GET_ADMINS":
        "Tidak dapat menggunakan perintah ini dalam grup saat ini.",

    "VERSION":
        "Versi Bot saat ini: {}",

    "ABOUT_MSG":
        "Bot ini adalah perangkat lunak gratis dan open-sourced (sumber terbuka) dalam lisensi GNU-GPL. \nBot dikembangkan oleh {}.\n\nKamu bisa mengecek kodenya disini:\n{}\n\nKamu menyukai hasil kerjaku? Belikan saya kopi.\n\nPaypal:\n{}\n\nBTC:\n{}",

    "COMMANDS":
        "Daftar Perintah:\n————————————————\n/start - Menampilkan informasi awal tentang bot.\n\n/help - Menampilkan informasi yang berguna.\n\n/commands - Menampilkan pesan ini. Informasi tentang semua perintah yang tersedia dan penjelasannya.\n\n/language - Mengganti bahasa dalam pesan bot.\n\n/time - Mengganti waktu yang tersedia untuk menyelesaikan captcha.\n\n/difficulty - Mengganti tingkat kesulitan captcha (dari 1 sampai 5).\n\n/captcha_mode - Mengganti mode karakter captcha (nums: hanya angka, hex: angka dan huruf A-F, ascii: Angka dan huruf A-Z).\n\n/welcome_msg - Mengatur pesan selamat datang yang dikirimkan setelah pengguna menyelesaikan captcha.\n\n/enable - Mengaktifkan proteksi captcha dalam grup.\n\n/disable - Menonaktifkan proteksi captcha dalam grup.\n\n/version - Menampilkan versi Bot.\n\n/about - Menampilkan info tentang saya."
}
