{
    "START":
        "Привет, я бот, который отправляет картинку с капчей для каждого нового присоединившегося пользователя к чату, и удаляю любого, кто не может решить капчу в течении указанного времени.\n\nЕсли пользователь попытается присоединиться к чату 5 раз подряд и не решит капчу, то я буду считать, что этот «пользователь» - бот, и он будет забанен. Кроме того, любое сообщение, содержащее URL-адрес, отправленный новым \"пользователем\" до завершения проверки, будет считаться спамом и будет удалено.\n\nНе забудьте дать мне права администратора, чтобы банить пользователей и удалять сообщения.\n\nВведите команду /help для получения дополнительной информации по моему функционалу\n\nЯ был полезен? Введите команду /about и подумайте о том, чтобы поддержать меня и сделать добровольное пожертвование",

    "HELP":
        "Помощь:\n————————————————\n- Я бот, который отправляет картинку с капчей для каждого нового присоединившегося пользователя к чату, и удаляю любого, кто не может решить капчу в течении указанного времени.\n\n- Если пользователь попытается присоединиться к чату 5 раз подряд и не решит капчу, то я буду считать, что этот «пользователь» - бот, и он будет забанен.\n\n- Кроме того, любое сообщение, содержащее URL-адрес, отправленный новым \"пользователем\" до завершения проверки, будет считаться спамом и будет удалено.\n\n- Вам нужно дать мне права администратора, чтобы банить пользователей и удалять сообщения.\n\n- Чтобы сохранять чистоту в чате, я автоматически удаляю все сообщения, связанные со мной, когда капча не решена, и пользователь был удален (через 5 минут).\n\n- По умолчанию у человека есть 5 минут чтобы решить капчу, но это можно настроить с помощью команды /time.\n\n- Вы можете включить/выключить защиту с помощью команд /enable и /disable.\n\n- Команды настроек могут использоваться только администраторами.\n\n- Чтобы изменить язык используйте команду /language.\n\n- Вы можете настроить уровень сложности капчи с помощью команды /difficulty.\n\n- Вы можете изменить капчу, чтобы использовать только цифры (по умолчанию) или полные цифры и буквы, используя команду /captcha_mode.\n\n- Чтобы настроить приветственное сообщение введите команду /welcome_msg.\n\n- Вы можете включить опцию, чтобы позволить мне применять ограничения для новых присоединившихся пользователей для отправки не-текстовых сообщений с помощью команды  /restrict_non_text.\n\n- Если бот является приватным, разрешите группы с помощью команды /allowgroup.\n\n- Нажмите /commands чтобы получить список всех доступных команд с кратким описанием.",

    "CMD_NOT_ALLOW":
        "Только администратор может использовать эту команду.",

    "LANG_CHANGE":
        "Язык был изменён на Русский.",

    "LANG_SAME":
        "Русский язык уже активирован\n\nПоддерживаемые языки:\n{}",

    "LANG_BAD_LANG":
        "Данный язык ещё не поддерживается\n\nПоддерживаемые языки:\n{}",

    "LANG_NOT_ARG":
        "Команде нужен язык для установки.\n\nПримеры:\n{}",

    "TIME_CHANGE":
        "Время, для решения капчи успешно изменено на {} минут.",

    "TIME_MAX_NOT_ALLOW":
        "Максимально допустимое время прохождения капчи составляет 20 минут.",

    "TIME_NOT_NUM":
        "Указанное время не является целым числом.",

    "TIME_NOT_ARG":
        "Команде необходимо установить значение времени (в минутах).\n\nПримеры:\n/time 3\n/time 5\n/time 10",

    "DIFFICULTY_CHANGE":
        "Сложность капчи успешно изменена на уровень {}.",

    "DIFFICULTY_NOT_NUM":
        "Предложенная сложность капчи не является числом.",

    "DIFFICULTY_NOT_ARG":
        "Команде нужен уровень сложности, чтобы установить (от 1 to 5).\n\nПримеры:\n/difficulty 1\n/difficulty 2\n/difficulty 3\n/difficulty 4\n/difficulty 5",

    "CAPTCHA_MODE_CHANGE":
        "Режим капчи успешно был изменён на \"{}\".",

    "CAPTCHA_MODE_INVALID":
        "Неверный режим капчи. Поддерживаемые варианты капчи: \"nums\", \"hex\" and \"ascii\".\n\nПримеры:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii\n/captcha_mode button",

    "CAPTCHA_MODE_NOT_ARG":
        "Необходимо выбрать режим. Доступные режимы:\n- Числовые капчи (\"nums\").\n- Hexadecimal Captchas, цифры и символы A-F (\"hex\").\n- Цифры и символы A-Z Капча (\"ascii\").\n\nExamples:\n/captcha_mode nums\n/captcha_mode hex\n/captcha_mode ascii\n/captcha_mode button",

    "WELCOME_MSG_SET":
        "Приветственное сообщение успешно изменено.",

    "WELCOME_MSG_UNSET":
        "Приветственное сообщение отключено.",

    "WELCOME_MSG_SET_NOT_ARG":
        "Поместите приветственное сообщение после команды.\n\nПримеры:\n/welcome_msg Привет, $user, добро пожаловать в чат, ознакомьтесь пожалуйста с правилами и ведите себя уважительно по отношению к другим пользователям.\n\nОтключить сообщение:\n/welcome_msg disable",

    "RESTRICT_NON_TEXT_MSG_ENABLED":
        "Включено ограничение на отправку нетекстовых сообщений для новых пользователей. Я собираюсь удалить права для новых присоединившихся пользователей, кроме отправки текстовых сообщений.",

    "RESTRICT_NON_TEXT_MSG_DISABLED":
        "Ограничение на отправку нетекстовых сообщений для новых пользователей отключено.",

    "RESTRICT_NON_TEXT_MSG_NOT_ARG":
        "Если вы хотите включить или отключить ограничение для новых присоединяющихся пользователей на отправку нетекстовых сообщений (Не разрешать пользователю отправлять мультимедийные или другие сообщения, а не текстовые. Администраторы могут вручную снова предоставить эти разрешения пользователям в будущем).\n\nПример:\n/restrict_non_text enable\n/restrict_non_text enable forever\n/restrict_non_text disable",

    "IGNORE_LIST_ADD_NOT_ARG":
        "Пожалуйста, поместите ID/alias пользователья после команды.\n\nПример:\n/add_ignore 1234567890\n/add_ignore @peter",

    "IGNORE_LIST_ADD_DUPLICATED":
        "Этот ID/alias уже находится в списке игнорируемых.",

    "IGNORE_LIST_ADD_LIMIT_EXCEEDED":
        "К сожалению, вы достигли максимального количества пользователей, добавленных в список игнорирования, удалите кого-то, чтобы добавить других.",

    "IGNORE_LIST_ADD_INVALID":
        "Этот id/alias недопустим.]",

    "IGNORE_LIST_ADD_SUCCESS":
        "Этот ID/alias был успешно добавлен!",

    "IGNORE_LIST_REMOVE_NOT_ARG":
        "Пожалуйста, поместите ID/alias пользователья после команды.\n\nПример:\n/remove_ignore 1234567890\n/remove_ignore @peter",

    "IGNORE_LIST_REMOVE_SUCCESS":
        "Этот ID/alias был успешно удален!",

    "IGNORE_LIST_REMOVE_NOT_IN_LIST":
        "Этого ID/alias нет в списке игнорируемых, ничего не было сделано.",

    "IGNORE_LIST_EMPTY":
        "Список игнорируемых чата пуст.",

    "NEW_USER_CAPTCHA_CAPTION":
        "Привет {}, добро пожаловать в {}, пожалуйста, решите капчу с цифрами или буквами на этом изображении, чтобы убедиться, что вы человек. Если вы не решите капчу в течение {} минут, вы будете автоматически удалены из группы.",

    "NEW_USER_BUTTON_MODE":
        "Привет, {}, добро пожаловать в {}. Нажмите на кнопку ниже, чтобы подтвердить, что вы человек. Если вы не сделаете этого в течение {} минут, вас автоматически исключат из группы.",

    "CAPTCHA_SOLVED":
        "Капча решена, пользователь подтвержден.\nДобро пожаловать в чат {}",

    "CAPTCHA_INCORRECT_0":
        "Код был введён неправильно. Попробуйте еще раз...",

    "CAPTCHA_INCORRECT_1":
        "Код был ввёден неправильно. Проверьте внимательно, капча имеет 4 числа...",

    "NEW_USER_KICK":
        "{} не решил капчу вовремя. пользователь был удалён из чата.",

    "NEW_USER_KICK_NOT_RIGHTS":
        "{} не решил капчу вовремя. Я попытался его выгнать, но у меня нет прав администратора, чтобы выгнать пользователя из чата.",

    "NEW_USER_KICK_NOT_IN_CHAT":
        "{} не решил капчу вовремя. Я попытался его выгнать, но пользователь не состоит в чате (покинул или был удален администратором).",

    "BOT_CANT_KICK":
        "{} не решил капчу вовремя. Я попытался его выгнать, но из-за непредвиденной проблемы (возможно, связанной с сетью или сервером) я не могу это сделать.",

    "CANT_DEL_MSG":
        "Я попытался удалить это сообщение, но у меня нет прав администратора для этого",

    "NEW_USER_BAN":
        "Предупреждение: это уже пятая попытка, {} попытался присоединиться к группе и не смог решить капчу. Пользователь был забанен. Чтобы позволить ему/ей войти снова, администратор должен вручную снять ограничения.",

    "NEW_USER_BAN_NOT_IN_CHAT":
        "Предупреждение: это уже пятая попытка, {} попытался присоединиться к группе и не смог решить капчу. Я попытался его заблокировать, но пользователь не состоит в чате (покинул или был удален администратором).",

    "NEW_USER_BAN_NOT_RIGHTS":
        "Предупреждение: это уже пятая попытка, {} попытался присоединиться к группе и не смог решить капчу. Я попытался его выгнать, но у меня нет прав администратора, чтобы выгнать пользователя из чата.",

    "BOT_CANT_BAN":
        "Предупреждение: это уже пятая попытка, {} попытался присоединиться к группе и не смог решить капчу. но из-за непредвиденной проблемы (возможно, связанной с сетью или сервером) я не могу это сделать.",

    "SPAM_DETECTED_RM":
        "Обнаружено сообщение с URL от {}, он еще не решил капчу. Сообщение было удалено чтобы сохранить Telegram свободным от спама:)",

    "SPAM_DETECTED_NOT_RM":
        "Обнаружено сообщение с URL от {}, он еще не решил капчу. Я попытался удалить сообщение со спамом, но у меня нет прав администратора для удаления сообщений",

    "NOT_TEXT_MSG_ALLOWED":
        "Удалено сообщение содержащее (изображение, аудио, файл...) от {}, чтобы сохранить Telegram свободным от спама.",

    "OTHER_CAPTCHA_BTN_TEXT":
        "Другие капчи",

    "PASS_BTN_TEXT":
        "Я не робот",

    "BOT_LEAVE_CHANNEL":
        "Этот бот не может быть использован в каналах, только в группах.",

    "ENABLE":
        "Защита от спама включена. Отключите его с помощью команды /disable",

    "DISABLE":
        "Защита от спама выключена.. Включите его с помощью команды /enable",

    "ALREADY_ENABLE":
        "Защита от спама уже активирована.",

    "ALREADY_DISABLE":
        "Защита от спама уже деактивирована.",

    "CAN_NOT_GET_ADMINS":
        "Не могу использовать эту команду в текущем чате.",

    "VERSION":
        "Текущая версия бота: {}",

    "ABOUT_MSG":
        "Этот бот является свободным программным обеспечением и с открытым исходным кодом под лицензией GNU-GPL.\nBot Developed by {}.\n\nВы можете проверить код здесь:\n{}\n\nТебе нравится моя работа? Сделай добровольное пожертвование.\n\nPaypal:\n{}\n\nBTC:\n{}",

    "COMMANDS":
        "Список команд:\n————————————————\n/start - Показывает начальную информацию о боте.\n\n/help - Показывает справочную информацию.\n\n/commands - Показывает информацию обо всех доступных командах и их описание.\n\n/language - Позволяет менять язык сообщений бота.\n\n/time - Позволяет изменить время, доступное для решения капчи.\n\n/difficulty - Позволяет изменить уровень сложности капчи (от 1 до 5).\n\n/captcha_mode - Позволяет изменить режим капчи (nums: просто цифры, hex: цифры и символы A-F, ascii: цифры и символы A-Z).\n\n/restrict_non_text -  После того, как новый пользователь решит капчу, применить ограничение, чтобы не позволять ему отправлять нетекстовые сообщения (изображения, видео, аудио) в течение 1 дня (или навсегда, используя ключ \"forever\").\n\n/add_ignore - Не запрашивать капчу у игнорируемого пользователя.\n\n/remove_ignore - Прекратить игнорировать пользователя.\n\n/ignore_list - Список игнорируемых пользователей.\n\n/welcome_msg - Позволяет настроить приветственное сообщение, которое отправляется после разрешения капчи.\n\n/allowgroup - Разрешить группе использовать бота (если бот является приватным).\n\n/enable - Включает защиту от спама в чате.\n\n/disable - Выключает защиту от спама в чате.\n\n/version - Показывает версию бота.\n\n/about - Показать информацию."
}
